vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32c092/FDCAN_registers.h
/* This file is generated by stm32_reggen.py from stm32c092xx.h
 * Do not edit this file manually! 
 * If corrections are needed, use the 
 * override mechanism(s) defined to modify the parsed results 
 * and re-run the script to update the file. 
 *
 * This file contains the FDCAN register type definitions for the stm32c092 series of chips. 
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "FDCAN_index.h"


typedef union { 
	struct {
		uint32_t DAY           : 8; // /*!<Timestamp Day                           */
		uint32_t MON           : 8; // /*!<Timestamp Month                         */
		uint32_t YEAR          : 4; // /*!<Timestamp Year                          */
		uint32_t SUBSTEP       : 4; // /*!<Sub-step of Core release                */
		uint32_t STEP          : 4; // /*!<Step of Core release                    */
		uint32_t REL           : 4; // /*!<Core release                            */
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,crel); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,crel),bits);

typedef union { 
	struct {
		uint32_t ETV           :32; // /*!<Endianness Test Value                    */
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,endn); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,endn),bits);

typedef union { 
	struct {
		uint32_t DSJW          : 4; // /*!<Synchronization Jump Width              */
		uint32_t DTSEG2        : 4; // /*!<Data time segment after sample point    */
		uint32_t DTSEG1        : 5; // /*!<Data time segment before sample point   */
		uint32_t _reserved13   : 3; 
		uint32_t DBRP          : 5; // /*!<Data BIt Rate Prescaler                 */
		uint32_t _reserved21   : 2; 
		uint32_t TDC           : 1; // /*!<Transceiver Delay Compensation          */
		uint32_t _reserved24   : 8; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,dbtp); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,dbtp),bits);

typedef union { 
	struct {
		uint32_t _reserved0    : 4; 
		uint32_t LBCK          : 1; // /*!<Loop Back mode                           */
		uint32_t TX            : 2; // /*!<Control of Transmit Pin                  */
		uint32_t RX            : 1; // /*!<Receive Pin                              */
		uint32_t _reserved8    :24; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,test); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,test),bits);

typedef union { 
	struct {
		uint32_t WDC           : 8; // /*!<Watchdog configuration                   */
		uint32_t WDV           : 8; // /*!<Watchdog value                           */
		uint32_t _reserved16   :16; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,rwd); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,rwd),bits);

typedef union { 
	struct {
		uint32_t INIT          : 1; // /*!<Initialization                           */
		uint32_t CCE           : 1; // /*!<Configuration Change Enable              */
		uint32_t ASM           : 1; // /*!<ASM Restricted Operation Mode            */
		uint32_t CSA           : 1; // /*!<Clock Stop Acknowledge                   */
		uint32_t CSR           : 1; // /*!<Clock Stop Request                       */
		uint32_t MON           : 1; // /*!<Bus Monitoring Mode                      */
		uint32_t DAR           : 1; // /*!<Disable Automatic Retransmission         */
		uint32_t TEST          : 1; // /*!<Test Mode Enable                         */
		uint32_t FDOE          : 1; // /*!<FD Operation Enable                      */
		uint32_t BRSE          : 1; // /*!<FDCAN Bit Rate Switching                 */
		uint32_t _reserved10   : 2; 
		uint32_t PXHD          : 1; // /*!<Protocol Exception Handling Disable      */
		uint32_t EFBI          : 1; // /*!<Edge Filtering during Bus Integration    */
		uint32_t TXP           : 1; // /*!<Two CAN bit times Pause                  */
		uint32_t NISO          : 1; // /*!<Non ISO Operation                        */
		uint32_t _reserved16   :16; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,cccr); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,cccr),bits);

typedef union { 
	struct {
		uint32_t NTSEG2        : 7; // /*!<Nominal Time segment after sample point  */
		uint32_t _reserved7    : 1; 
		uint32_t NTSEG1        : 8; // /*!<Nominal Time segment before sample point */
		uint32_t NBRP          : 9; // /*!<Bit Rate Prescaler                       */
		uint32_t NSJW          : 7; // /*!<Nominal (Re)Synchronization Jump Width   */
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,nbtp); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,nbtp),bits);

typedef union { 
	struct {
		uint32_t TSS           : 2; // /*!<Timestamp Select                         */
		uint32_t _reserved2    :14; 
		uint32_t TCP           : 4; // /*!<Timestamp Counter Prescaler              */
		uint32_t _reserved20   :12; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,tscc); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,tscc),bits);

typedef union { 
	struct {
		uint32_t TSC           :16; // /*!<Timestamp Counter                        */
		uint32_t _reserved16   :16; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,tscv); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,tscv),bits);

typedef union { 
	struct {
		uint32_t ETOC          : 1; // /*!<Enable Timeout Counter                   */
		uint32_t TOS           : 2; // /*!<Timeout Select                           */
		uint32_t _reserved3    :13; 
		uint32_t TOP           :16; // /*!<Timeout Period                           */
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,tocc); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,tocc),bits);

typedef union { 
	struct {
		uint32_t TOC           :16; // /*!<Timeout Counter                          */
		uint32_t _reserved16   :16; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,tocv); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,tocv),bits);

typedef union { 
	struct {
		uint32_t TEC           : 8; // /*!<Transmit Error Counter                   */
		uint32_t REC           : 7; // /*!<Receive Error Counter                    */
		uint32_t RP            : 1; // /*!<Receive Error Passive                    */
		uint32_t CEL           : 8; // /*!<CAN Error Logging                        */
		uint32_t _reserved24   : 8; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,ecr); 
