vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32c092/FDCAN_registers.h
typedef union { 
	struct {
		uint32_t TIE           : 3; // /*!<Transmission Interrupt Enable            */
		uint32_t _reserved3    :29; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,txbtie); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,txbtie),bits);

typedef union { 
	struct {
		uint32_t CFIE          : 3; // /*!<Cancellation Finished Interrupt Enable   */
		uint32_t _reserved3    :29; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,txbcie); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,txbcie),bits);

typedef union { 
	struct {
		uint32_t EFFL          : 3; // /*!<Event FIFO Fill Level                    */
		uint32_t _reserved3    : 5; 
		uint32_t EFGI          : 2; // /*!<Event FIFO Get Index                     */
		uint32_t _reserved10   : 6; 
		uint32_t EFPI          : 2; // /*!<Event FIFO Put Index                     */
		uint32_t _reserved18   : 6; 
		uint32_t EFF           : 1; // /*!<Event FIFO Full                          */
		uint32_t TEFL          : 1; // /*!<Tx Event FIFO Element Lost               */
		uint32_t _reserved26   : 6; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,txefs); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,txefs),bits);

typedef union { 
	struct {
		uint32_t EFAI          : 2; // /*!<Event FIFO Acknowledge Index             */
		uint32_t _reserved2    :30; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,txefa); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,txefa),bits);

typedef union { 
	struct {
		uint32_t PDIV          : 4; // /*!<Input Clock Divider                      */
		uint32_t _reserved4    :28; 
	} QEMU_PACKED bits;
	uint32_t raw; 
}  REGDEF_NAME(c092_fdcan,ckdiv); 
CHECK_TYPEDEF_u32(REGDEF_NAME(c092_fdcan,ckdiv),bits);

static const stm32_reginfo_t stm32_c092_fdcan_reginfo[RI_END] = 
{ 
	[RI_CREL           ] = { .reset_val = 0x32141218, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_ENDN           ] = { .reset_val = 0x87654321, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFFFF }, /* mask = 0b11111111111111111111111111111111 */
	[RI_DBTP           ] = { .reset_val = 0x00000A33, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x009F1FFF }, /* mask = 0b00000000100111110001111111111111 */
	[RI_TEST           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000000F0 }, /* mask = 0b00000000000000000000000011110000 */
	[RI_RWD            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_CCCR           ] = { .reset_val = 0x00000001, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000F3FF }, /* mask = 0b00000000000000001111001111111111 */
	[RI_NBTP           ] = { .reset_val = 0x06000A03, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFFFF7F }, /* mask = 0b11111111111111111111111101111111 */
	[RI_TSCC           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x000F0003 }, /* mask = 0b00000000000011110000000000000011 */
	[RI_TSCV           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_TOCC           ] = { .reset_val = 0xFFFF0000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0xFFFF0007 }, /* mask = 0b11111111111111110000000000000111 */
	[RI_TOCV           ] = { .reset_val = 0x0000FFFF, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000FFFF }, /* mask = 0b00000000000000001111111111111111 */
	[RI_ECR            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00FFFFFF }, /* mask = 0b00000000111111111111111111111111 */
	[RI_PSR            ] = { .reset_val = 0x00000707, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x007F7FFF }, /* mask = 0b00000000011111110111111111111111 */
	[RI_TDCR           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00007F7F }, /* mask = 0b00000000000000000111111101111111 */
	[RI_IR             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00FFFFFF }, /* mask = 0b00000000111111111111111111111111 */
	[RI_IE             ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00FFFFFF }, /* mask = 0b00000000111111111111111111111111 */
	[RI_ILS            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000007F }, /* mask = 0b00000000000000000000000001111111 */
	[RI_ILE            ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000003 }, /* mask = 0b00000000000000000000000000000011 */
	[RI_RXGFC          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0F1F033F }, /* mask = 0b00001111000111110000001100111111 */
	[RI_XIDAM          ] = { .reset_val = 0x1FFFFFFF, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x1FFFFFFF }, /* mask = 0b00011111111111111111111111111111 */
	[RI_HPMS           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00009FC7 }, /* mask = 0b00000000000000001001111111000111 */
	[RI_RXF0S          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0303030F }, /* mask = 0b00000011000000110000001100001111 */
	[RI_RXF0A          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000007 }, /* mask = 0b00000000000000000000000000000111 */
	[RI_RXF1S          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0303030F }, /* mask = 0b00000011000000110000001100001111 */
	[RI_RXF1A          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000007 }, /* mask = 0b00000000000000000000000000000111 */
	[RI_TXBC           ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x01000000 }, /* mask = 0b00000001000000000000000000000000 */
	[RI_TXFQS          ] = { .reset_val = 0x00000003, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00230307 }, /* mask = 0b00000000001000110000001100000111 */
	[RI_TXBRP          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000007 }, /* mask = 0b00000000000000000000000000000111 */
	[RI_TXBAR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000007 }, /* mask = 0b00000000000000000000000000000111 */
	[RI_TXBCR          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000007 }, /* mask = 0b00000000000000000000000000000111 */
	[RI_TXBTO          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000007 }, /* mask = 0b00000000000000000000000000000111 */
	[RI_TXBCF          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000007 }, /* mask = 0b00000000000000000000000000000111 */
	[RI_TXBTIE         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000007 }, /* mask = 0b00000000000000000000000000000111 */
	[RI_TXBCIE         ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000007 }, /* mask = 0b00000000000000000000000000000111 */
	[RI_TXEFS          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x03030307 }, /* mask = 0b00000011000000110000001100000111 */
	[RI_TXEFA          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x00000003 }, /* mask = 0b00000000000000000000000000000011 */
	[RI_CKDIV          ] = { .reset_val = 0x00000000, .not_reserved = true, .unimp_mask = 0x00000000, .mask = 0x0000000F }, /* mask = 0b00000000000000000000000000001111 */
}; 

