vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/stm32c092/FDCAN_registers.h
typedef union { 
	struct {
		REGDEF_NAME(c092_fdcan,crel) CREL;
		REGDEF_NAME(c092_fdcan,endn) ENDN;
		uint32_t _reserved0x8;
		REGDEF_NAME(c092_fdcan,dbtp) DBTP;
		REGDEF_NAME(c092_fdcan,test) TEST;
		REGDEF_NAME(c092_fdcan,rwd) RWD;
		REGDEF_NAME(c092_fdcan,cccr) CCCR;
		REGDEF_NAME(c092_fdcan,nbtp) NBTP;
		REGDEF_NAME(c092_fdcan,tscc) TSCC;
		REGDEF_NAME(c092_fdcan,tscv) TSCV;
		REGDEF_NAME(c092_fdcan,tocc) TOCC;
		REGDEF_NAME(c092_fdcan,tocv) TOCV;
		uint32_t _reserved0x30[ 4]; 
		REGDEF_NAME(c092_fdcan,ecr) ECR;
		REGDEF_NAME(c092_fdcan,psr) PSR;
		REGDEF_NAME(c092_fdcan,tdcr) TDCR;
		uint32_t _reserved0x4C;
		REGDEF_NAME(c092_fdcan,ir) IR;
		REGDEF_NAME(c092_fdcan,ie) IE;
		REGDEF_NAME(c092_fdcan,ils) ILS;
		REGDEF_NAME(c092_fdcan,ile) ILE;
		uint32_t _reserved0x60[ 8]; 
		REGDEF_NAME(c092_fdcan,rxgfc) RXGFC;
		REGDEF_NAME(c092_fdcan,xidam) XIDAM;
		REGDEF_NAME(c092_fdcan,hpms) HPMS;
		uint32_t _reserved0x8C;
		REGDEF_NAME(c092_fdcan,rxf0s) RXF0S;
		REGDEF_NAME(c092_fdcan,rxf0a) RXF0A;
		REGDEF_NAME(c092_fdcan,rxf1s) RXF1S;
		REGDEF_NAME(c092_fdcan,rxf1a) RXF1A;
		uint32_t _reserved0xA0[ 8]; 
		REGDEF_NAME(c092_fdcan,txbc) TXBC;
		REGDEF_NAME(c092_fdcan,txfqs) TXFQS;
		REGDEF_NAME(c092_fdcan,txbrp) TXBRP;
		REGDEF_NAME(c092_fdcan,txbar) TXBAR;
		REGDEF_NAME(c092_fdcan,txbcr) TXBCR;
		REGDEF_NAME(c092_fdcan,txbto) TXBTO;
		REGDEF_NAME(c092_fdcan,txbcf) TXBCF;
		REGDEF_NAME(c092_fdcan,txbtie) TXBTIE;
		REGDEF_NAME(c092_fdcan,txbcie) TXBCIE;
		REGDEF_NAME(c092_fdcan,txefs) TXEFS;
		REGDEF_NAME(c092_fdcan,txefa) TXEFA;
		uint32_t _reserved0xEC[ 5]; 
		REGDEF_NAME(c092_fdcan,ckdiv) CKDIV;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END]; 
}  REGDEF_NAME(c092,fdcan); 
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(c092,fdcan)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), CREL) != 0, "Offset mismatch for CREL");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), ENDN) != 4, "Offset mismatch for ENDN");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), DBTP) != 12, "Offset mismatch for DBTP");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TEST) != 16, "Offset mismatch for TEST");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), RWD) != 20, "Offset mismatch for RWD");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), CCCR) != 24, "Offset mismatch for CCCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), NBTP) != 28, "Offset mismatch for NBTP");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TSCC) != 32, "Offset mismatch for TSCC");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TSCV) != 36, "Offset mismatch for TSCV");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TOCC) != 40, "Offset mismatch for TOCC");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TOCV) != 44, "Offset mismatch for TOCV");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), ECR) != 64, "Offset mismatch for ECR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), PSR) != 68, "Offset mismatch for PSR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TDCR) != 72, "Offset mismatch for TDCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), IR) != 80, "Offset mismatch for IR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), IE) != 84, "Offset mismatch for IE");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), ILS) != 88, "Offset mismatch for ILS");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), ILE) != 92, "Offset mismatch for ILE");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), RXGFC) != 128, "Offset mismatch for RXGFC");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), XIDAM) != 132, "Offset mismatch for XIDAM");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), HPMS) != 136, "Offset mismatch for HPMS");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), RXF0S) != 144, "Offset mismatch for RXF0S");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), RXF0A) != 148, "Offset mismatch for RXF0A");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), RXF1S) != 152, "Offset mismatch for RXF1S");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), RXF1A) != 156, "Offset mismatch for RXF1A");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TXBC) != 192, "Offset mismatch for TXBC");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TXFQS) != 196, "Offset mismatch for TXFQS");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TXBRP) != 200, "Offset mismatch for TXBRP");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TXBAR) != 204, "Offset mismatch for TXBAR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TXBCR) != 208, "Offset mismatch for TXBCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TXBTO) != 212, "Offset mismatch for TXBTO");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TXBCF) != 216, "Offset mismatch for TXBCF");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TXBTIE) != 220, "Offset mismatch for TXBTIE");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TXBCIE) != 224, "Offset mismatch for TXBCIE");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TXEFS) != 228, "Offset mismatch for TXEFS");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), TXEFA) != 232, "Offset mismatch for TXEFA");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(c092,fdcan), CKDIV) != 256, "Offset mismatch for CKDIV");
